In [76]:
import pandas as pd
import numpy as np

In [77]:
my_series = pd.Series([5, 6, 7, 8, 9, 10])
my_series

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [78]:
my_series.index

RangeIndex(start=0, stop=6, step=1)

In [79]:
my_series.values

array([ 5,  6,  7,  8,  9, 10], dtype=int64)

In [80]:
my_series2 = pd.Series([5, 6, 7, 8, 9, 10], index=['a', 'b', 'c', 'd', 'g', 'h'])
my_series2

a     5
b     6
c     7
d     8
g     9
h    10
dtype: int64

In [81]:
my_series[[4]]

4    9
dtype: int64

In [82]:
my_series2[['g']]

g    9
dtype: int64

In [83]:
my_series[(my_series > 6)]

2     7
3     8
4     9
5    10
dtype: int64

In [84]:
my_series2[['g']] = 151
my_series2

a      5
b      6
c      7
d      8
g    151
h     10
dtype: int64

In [85]:
my_series2.index.name = 'letters'
my_series2

letters
a      5
b      6
c      7
d      8
g    151
h     10
dtype: int64

In [86]:
#Pandas DataFrame

In [87]:
df = pd.DataFrame({
    'country': ['Москва'],
    'population': [23.05],
    'square': [2513556]
})

df.index = ['Ru']

df

   country  population   square
Ru  Москва       23.05  2513556

In [88]:
type(df.population)

pandas.core.series.Series

In [89]:
# pd.read_csv('filename')
# pd.read_sql/excel/e.t.c('filename')

In [90]:
# 'nameofdf'.head/tail()

In [91]:
#c_size = 10000

#for gm_chunk in pd.read_csv('name', sep = ',',chunksize=c_size):
#    print(gm_chunk.shape)

In [92]:
df.loc['Ru']

country        Москва
population      23.05
square        2513556
Name: Ru, dtype: object

In [93]:
df.iloc[0]

country        Москва
population      23.05
square        2513556
Name: Ru, dtype: object

In [94]:
df.loc[['Ru'],'country']

Ru    Москва
Name: country, dtype: object

In [95]:
df[df.population > 10][['country', 'square']]

   country   square
Ru  Москва  2513556

In [96]:
df['density'] = df['population'] / df['square'] * 1000000

In [97]:
df

   country  population   square   density
Ru  Москва       23.05  2513556  9.170275

In [98]:
df.drop(['density'], axis = 1 , inplace = True)
df

   country  population   square
Ru  Москва       23.05  2513556

In [99]:
df = df.rename(columns = {'population': 'pop'})
df

   country    pop   square
Ru  Москва  23.05  2513556

In [100]:
df.nlargest(3,'pop')

   country    pop   square
Ru  Москва  23.05  2513556

In [102]:
df = pd.read_csv('A:\Загрузки\meteorite-landings.csv', sep = ',')
df.head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.166670, -64.950000)"

In [106]:
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

In [107]:
pd.set_option('display.precision', 3)

In [108]:
df

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.775,6.083,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.183,10.233,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.883,-99.900,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.167,-64.950,"(-33.166670, -64.950000)"
...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.037,17.018,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.783,8.967,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.250,17.667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.789,41.505,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.983,-115.683,"(33.983330, -115.683330)"

In [109]:
df.describe(include=['object'])

                     name nametype recclass   fall           GeoLocation
count               45716    45716    45716  45716                 38401
unique              45716        2      466      2                 17100
top     Allan Hills 88007    Valid       L6  Found  (0.000000, 0.000000)
freq                    1    45641     8285  44609                  6214

In [110]:
df.describe()

              id       mass       year     reclat    reclong
count  45716.000  4.558e+04  45428.000  38401.000  38401.000
mean   26889.735  1.328e+04   1991.772    -39.123     61.074
std    16860.683  5.750e+05     27.181     46.379     80.647
min        1.000  0.000e+00    301.000    -87.367   -165.433
25%    12688.750  7.200e+00   1987.000    -76.714      0.000
50%    24261.500  3.260e+01   1998.000    -71.500     35.667
75%    40656.750  2.026e+02   2003.000      0.000    157.167
max    57458.000  6.000e+07   2501.000     81.167    354.473

In [111]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 2.6+ MB
None

In [114]:
df.recclass.value_counts()[:5]

L6    8285
H5    7142
L5    4796
H6    4528
H4    4211
Name: recclass, dtype: int64

In [115]:
for dtype in ['float','int','object']:
    selected_dtype = df.select_dtypes(include=[dtype])
    mean_usage_b = selected_dtype.memory_usage(deep=True).mean()
    mean_usage_mb = mean_usage_b / 1024** 2
    print("Avarage memory usage for {} columns: {:03.2f} MB".format(dtype,mean_usage_mb))

Avarage memory usage for float columns: 0.28 MB
Avarage memory usage for int columns: 0.00 MB
Avarage memory usage for object columns: 1.41 MB

In [116]:
df['mass'] = df['mass'].astype('float32')

In [117]:
[(col,df[col].unique()) for col in df.columns]

[('name',
  array(['Aachen', 'Aarhus', 'Abee', ..., 'Zlin', 'Zubkovsky', 'Zulu Queen'],
        dtype=object)),
 ('id', array([    1,     2,     6, ..., 30410, 31357, 30414], dtype=int64)),
 ('nametype', array(['Valid', 'Relict'], dtype=object)),
 ('recclass',
  array(['L5', 'H6', 'EH4', 'Acapulcoite', 'L6', 'LL3-6', 'H5', 'L',
         'Diogenite-pm', 'Unknown', 'H4', 'H', 'Iron, IVA', 'CR2-an', 'LL5',
         'CI1', 'L/LL4', 'Eucrite-mmict', 'CV3', 'Ureilite-an',
         'Stone-uncl', 'L3', 'Angrite', 'LL6', 'L4', 'Aubrite',
         'Iron, IIAB', 'Iron, IAB-sLL', 'Iron, ungrouped', 'CM2', 'OC',
         'Mesosiderite-A1', 'LL4', 'C2-ung', 'LL3.8', 'Howardite',
         'Eucrite-pmict', 'Diogenite', 'LL3.15', 'LL3.9', 'Iron, IAB-MG',
         'H/L3.9', 'Iron?', 'Eucrite', 'H4-an', 'L/LL6', 'Iron, IIIAB',
         'H/L4', 'H4-5', 'L3.7', 'LL3.4', 'Martian (chassignite)', 'EL6',
         'H3.8', 'H3-5', 'H5-6', 'Mesosiderite', 'H5-7', 'L3-6', 'H4-6',
         'Ureilite', 'Iron, IID', 'Mesosiderite-A3/4', 'CO3.3', 'H3',
         'EH3/4-an', 'Iron, IIE', 'L/LL5', 'H3.7', 'CBa', 'H4/5', 'H3/4',
         'H?', 'H3-6', 'L3.4', 'Iron, IAB-sHL', 'L3.7-6', 'EH7-an', 'Iron',
         'CR2', 'CO3.2', 'K3', 'L5/6', 'CK4', 'Iron, IIE-an', 'L3.6',
         'LL3.2', 'CO3.5', 'Lodranite', 'Mesosiderite-A3', 'L3-4', 'H5/6',
         'Pallasite, PMG', 'Eucrite-cm', 'Pallasite', 'L5-6', 'CO3.6',
         'Martian (nakhlite)', 'LL3.6', 'C3-ung', 'H3-4', 'CO3.4', 'EH3',
         'Iron, IAB-ung', 'Winonaite', 'LL', 'Eucrite-br', 'Iron, IIF',
         'R3.8-6', 'L4-6', 'EH5', 'LL3.00', 'H3.4', 'Martian (shergottite)',
         'Achondrite-ung', 'LL3.3', 'C', 'H/L3.6', 'Iron, IIIAB-an', 'LL7',
         'Mesosiderite-B2', 'LL4-6', 'CO3.7', 'L/LL6-an',
         'Iron, IAB complex', 'Pallasite, PMG-an', 'H3.9/4', 'L3.8',
         'LL5-6', 'LL3.8-6', 'L3.9', 'L4-5', 'L3-5', 'LL4/5', 'L4/5',
         'H3.9', 'H3.6-6', 'H3.8-5', 'H3.8/4', 'H3.9-5', 'CH3', 'R3.8-5',
         'L3.9/4', 'E4', 'CO3', 'Chondrite-ung', 'H~5', 'H~6', 'L/LL3.10',
         'EL5', 'LL3', 'L~6', 'L~3', 'H~4', 'L(LL)3.5-3.7', 'Iron, IIIE-an',
         'H3.6', 'L3.4-3.7', 'L3.5', 'CM1/2', 'Martian (OPX)', 'Brachinite',
         'LL7(?)', 'LL6(?)', 'Eucrite-Mg rich', 'H3.5-4', 'EL3', 'R3.6',
         'H3.5', 'CM1', 'L/LL3', 'H7', 'L(?)3', 'L3.2', 'L3.7-3.9',
         'Mesosiderite-B1', 'LL3.7', 'CO3.0', 'LL3.5', 'L3.7-4',
         'Eucrite-unbr', 'CV3-an', 'Lunar (anorth)', 'L3.3',
         'Iron, IAB-sLM', 'Lunar', 'Iron, IC', 'Iron, IID-an', 'Iron, IIIE',
         'Iron, IVA-an', 'CK6', 'L3.1', 'CK5', 'H3.3', 'H3.7-6', 'E6',
         'H3.0', 'H3.1', 'L3.0', 'L/LL3.4', 'C6', 'LL3.0', 'Lunar (gabbro)',
         'R4', 'C4', 'Iron, IIG', 'Iron, IIC', 'C1-ung', 'H5-an', 'EH4/5',
         'Iron, IIIF', 'R3-6', 'Mesosiderite-B4', 'L6/7', 'Relict H',
         'L-imp melt', 'CK3', 'H3-an', 'Iron, IVB', 'R3.8', 'L~5',
         'Mesosiderite-an', 'Mesosiderite-A2', 'Pallasite, PES', 'C4-ung',
         'Iron, IAB?', 'Mesosiderite-A', 'R3.5-6', 'H3.9-6',
         'Ureilite-pmict', 'LL~6', 'CK4/5', 'EL4',
         'Lunar (feldsp. breccia)', 'L3.9-6', 'H-an', 'L/LL3-6', 'L/LL3-5',
         'H/L3.5', 'H/L3', 'R3-4', 'CK3-an', 'LL4-5', 'H/L6', 'L3/4',
         'H-imp melt', 'CR', 'Chondrite-fusion crust', 'Iron, IAB-sLH',
         'H(L)3-an', 'L(LL)3', 'H(L)3', 'R3', 'L7', 'CM-an', 'L/LL~6',
         'L/LL~5', 'L~4', 'L/LL~4', 'LL(L)3', 'H3.2', 'L-melt breccia',
         'H6-melt breccia', 'H5-melt breccia', 'H-melt rock', 'Eucrite-an',
         'Lunar (bas/anor)', 'LL5/6', 'LL3/4', 'H3.4/3.5', 'Lunar (basalt)',
         'H/L5', 'H(5?)', 'LL-imp melt', 'Mesosiderite?', 'H~4/5',
         'L6-melt breccia', 'L3.5-3.7', 'Iron, IIAB-an', 'L3.3-3.7',
         'L3.2-3.6', 'L3.3-3.6', 'Acapulcoite/Lodranite', 'Mesosiderite-B',
         'CK5/6', 'L3.05', 'C2', 'C4/5', 'L/LL3.2', 'Iron, IIIAB?',
         'L3.5-5', 'L/LL(?)3', 'H4(?)', 'Iron, IAB-sHH', 'Relict iron',
         'EL4/5', 'L5-7', 'Diogenite-an', 'CR1', 'H5 ', 'L5 ', 'H4 ', 'L4 ',
         'E', 'L6 ', 'H3 ', 'LL6 ', 'H-metal', 'H6 ', 'L-metal',
         'Relict OC', 'EH', 'Mesosiderite-A4', 'L/LL5/6', 'H3.8-4', 'CBb',
         'EL6/7', 'EL7', 'CH/CBb', 'CO3.8', 'H/L~4', 'Mesosiderite-C2',
         'R5', 'H4/6', 'L-melt rock', 'H3.7-5', 'LL3.7-6', 'H3.7/3.8',
         'L3.7/3.8', 'EH-imp melt', 'R', 'Fusion crust', 'Aubrite-an', 'R6',
         'LL-melt rock', 'L3.5-3.9', 'L3.2-3.5', 'L3.3-3.5', 'L3.0-3.7',
         'E3-an', 'K', 'E3', 'Acapulcoite/lodranite', 'CK4-an', 'L(LL)3.05',
         'L3.10', 'CB', 'Diogenite-olivine', 'EL-melt rock', 'EH6',
         'Pallasite, ungrouped', 'L/LL4/5', 'L3.8-an', 'Iron, IAB-an',
         'C5/6-ung', 'CV2', 'Iron, IC-an', 'Lunar (bas. breccia)', 'L3.8-6',
         'R3/4', 'R3.9', 'CK', 'LL3.10', 'R4/5', 'L3.8-5', 'Mesosiderite-C',
         'Enst achon', 'H/L3-4', 'L(H)3', 'LL3.1', 'OC3', 'LL6/7', 'R3.7',
         'CO3 ', 'CH3 ', 'LL~4', 'LL~4/5', 'L(LL)~4', 'H3.05', 'H3.10',
         'Impact melt breccia', 'LL3-5', 'H/L3.7', 'Martian', 'CO3.1',
         'Lunar (bas/gab brec)', 'Achondrite-prim', 'LL3-4', 'LL<3.5',
         'CK3/4', 'CK3.8', 'L/LL-melt rock', 'H6/7', 'EL6 ',
         'Iron, IAB-sHL-an', 'CM2-an', 'R3-5', 'L4-melt rock',
         'L6-melt rock', 'H/L4/5', 'EL3/4', 'H/L6-melt rock',
         'Enst achon-ung', 'L3-7', 'R3.4', 'LL3.05', 'LL4/6', 'LL3.8-4',
         'H3.15', 'C3.0-ung', 'LL-melt breccia', 'LL6-melt breccia',
         'L5-melt breccia', 'LL(L)3.1', 'LL6-an', 'L4-melt breccia',
         'Howardite-an', 'H4-melt breccia', 'Martian (basaltic breccia)',
         'L3-melt breccia', 'L~4-6', 'LL~5', 'R3.5-4', 'CR7',
         'H-melt breccia', 'Lunar (norite)', 'L3.00', 'H3.0-3.4', 'L/LL4-6',
         'CM', 'EH7', 'L4-an', 'E-an', 'H3.8/3.9', 'L3.9-5', 'H3.8-6',
         'H3.4-5', 'L3.0-3.9', 'L3.5-3.8', 'H3.2-3.7', 'L3.6-4',
         'Iron, IIE?', 'C3/4-ung', 'L/LL3.5', 'L/LL3.6/3.7', 'H/L4-5',
         'LL~3', 'Pallasite?', 'LL5-7', 'LL3.9/4', 'H3.8-an', 'CR-an',
         'L/LL5-6', 'L(LL)5', 'L(LL)6', 'LL3.1-3.5', 'E5', 'Lodranite-an',
         'H3.2-6', 'H(?)4', 'E5-an', 'H3.2-an', 'EH6-an', 'Stone-ung',
         'C1/2-ung', 'L/LL'], dtype=object)),
 ('mass',
  array([2.100e+01, 7.200e+02, 1.070e+05, ..., 9.000e+05, 1.475e+03,
         2.167e+03], dtype=float32)),
 ('fall', array(['Fell', 'Found'], dtype=object)),
 ('year',
  array([1880., 1951., 1952., 1976., 1902., 1919., 1949., 1814., 1930.,
         1920., 1974., 1925., 1769., 1838., 1959., 1981., 1957., 2001.,
         1806., 1766., 2002., 1835., 1873., 1860., 1900., 1883., 1899.,
         1969., 2008., 1977., 1895., 1898., 1939.,   nan, 1822., 1869.,
         1942., 1971., 1984., 1914., 1803., 1954., 1932., 1950., 1805.,
         2009., 1923., 1886., 1896., 1933., 1945., 1836., 1865., 1842.,
         1858., 1908., 1855., 1968., 1938., 1934., 1929., 1922., 1907.,
         1993., 1871., 1892., 1913., 1790., 1704., 1904., 1910., 1965.,
         2006., 1994., 2012., 1989., 1916., 1893., 1961., 1937., 1798.,
         2004., 1943., 1924., 1811., 1859., 1921., 1877., 1940., 1905.,
         1827., 1887., 1999., 1843., 1796., 1941., 1906., 1909., 1833.,
         1804., 1962., 1808., 1894., 1852., 1812., 1823., 2003., 2011.,
         1847., 1956., 1960., 1964., 2007., 1990., 1946., 1863., 1861.,
         1870., 1991., 1866., 1973., 1846., 1874., 1791., 1848., 1583.,
         1810., 1988., 1840., 1998., 1885., 1834., 1815., 1841., 2013.,
         1901., 1966., 1978., 1979., 1917., 1890., 1844., 1936., 1878.,
         1868., 1829., 1897., 1911., 1967., 1884., 1903., 1864., 1995.,
         1970., 1853., 1872., 1947., 1785., 1399., 1491., 1889., 1837.,
         1879., 1875., 1996., 1944., 1882., 1654., 1826., 2000., 1918.,
         1881., 1983., 1980., 1891., 1972., 1982., 1851., 1817., 1628.,
         1857., 1912., 1825., 1963., 1751., 2010., 1975., 1928., 1926.,
         1621., 1819., 1997., 1876., 1821., 1955., 1850., 1787., 1867.,
         1809., 1986., 1931., 1985., 1987., 1830., 1845., 1813., 1854.,
         1839., 1820., 1935., 1768., 1753., 1927., 1948., 1801., 1992.,
         1953., 1915., 1862., 1632., 1849., 1637., 1795.,  920., 1750.,
          860., 1662., 1741., 1958., 1519., 1671., 1856., 1775., 1779.,
         1723., 1740., 1824., 1828., 1490., 1636., 1688., 1715., 1773.,
         1818., 1794., 1647., 1623., 1807., 1668., 1495., 1831., 2005.,
         1888., 1784., 1575., 1793.,  301., 1749., 1781., 1600., 2101.,
         1797., 1716., 1724., 1776., 2501., 1832.,  601., 1792.])),
 ('reclat',
  array([50.775  , 56.18333, 54.21667, ..., 31.2    , 29.037  , 49.78917])),
 ('reclong',
  array([   6.08333,   10.23333, -113.     , ...,    8.96667,   41.5046 ,
         -115.68333])),
 ('GeoLocation',
  array(['(50.775000, 6.083330)', '(56.183330, 10.233330)',
         '(54.216670, -113.000000)', ..., '(49.250000, 17.666670)',
         '(49.789170, 41.504600)', '(33.983330, -115.683330)'], dtype=object))]

In [118]:
df.sort_values(by=['recclass', 'mass'], ascending=[True, False]).head(2)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
27673,Northwest Africa 2656,32485,Valid,Acapulcoite,7500.0,Found,2003.0,NaN,NaN,NaN
30353,Northwest Africa 725,17807,Valid,Acapulcoite,3824.0,Found,NaN,30.6,-5.05,"(30.600000, -5.050000)"

In [119]:
df.loc[0:5,:]

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.775,6.083,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.183,10.233,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.883,-99.900,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.167,-64.950,"(-33.166670, -64.950000)"
5,Adhi Kot,379,Valid,EH4,4239.0,Fell,1919.0,32.100,71.800,"(32.100000, 71.800000)"